{
  "projects": [
    {
      "Name": "Audio Soundscape",
      "Status": "Complete",
      "Date": "2023-09-09T00:00:00Z",
      "Audio": "CS7028 Audio Assignment 2- Nangole Martin_Inbetween.wav",
      "Loop": true,
      "Tags": ["Audio"],
      "Description": [
        "An immersive audio soundscape created to evoke different moods using ambient sounds."
      ]
    },
    {
      "Name": "Ice Cream Shop Branding",
      "Status": "Complete",
      "Date": "2023-10-10T00:00:00Z",
      "Image": "Murphy_s Ice Cream Pint.png",
      "Tags": ["Branding & Design"],
      "Description": [
        "A branding project for an ice cream shop, including logo design, color palette, and promotional materials."
      ]
    },
    {
      "Name": "Chichén Itzá",
      "Status": "Complete",
      "Date": "2025-04-15T00:00:00Z",
      "Image": "chichen-itza-homepage.png",
      "Tags": ["Branding & Design", "Frontend"],
      "Link": "https://martinnang.github.io/chichen-itza-website/",
      "LinkText": "Visit website",
      "Description": [
        "Designed low-fidelity wireframes and implemented A child-friendly, educational website for the archaeological site of Chichén Itzá using HTML5, CSS3, Bootstrap and JavaScript."
      ]
    },
    {
      "Name": "En Route",
      "Status": "Complete",
      "Date": "2025-04-15T00:00:00Z",
      "Image": "en-route-events-search.png",
      "Tags": ["Branding & Design", "Frontend", "Backend"],
      "Description": [
        "Implemented REST-API and React components for a travel itinerary web-application in Node.JS, Express.js, React and React-Bootstrap and using the OpenStreetMap database through Overpass API."
      ]
    },
    {
      "Name": "Maeve",
      "Status": "Complete",
      "Date": "2025-01-21T00:00:00Z",
      "Image": "maevesafety_logo.jpeg",
      "Tags": ["Branding & Design", "Research"],
      "Description": [
        "Conducted UX research, including surveys and semi-structured interviews, for a data-driven safety app for women. Participated in mentoring programs and pitch sessions as part of phase 1 of Launchbox, the Student Accelerator at Trinity College Dublin."
      ]
    },
    {
      "Name": "Ticketing Service Mockup",
      "Status": "Complete",
      "Date": "2020-03-30T00:00:00Z",
      "Image": "View Event.png",
      "Tags": ["App Design", "Media & Prototypes"],
      "Description": [
        "A prototype of a mobile app designed for task management, built using a popular prototyping tool."
      ]
    },
    {
      "Name": "Preserving Kenyan Oral Literature Through Environmental Storytelling",
      "Status": "Complete",
      "Date": "2025-05-15T00:00:00Z",
      "Tags": ["Research"],
      "Image": "research_paper_gameplay.png",
      "Link": "/documents/Preserving_Kenyan_Oral_Traditions_Through_Environmental_Storytelling.pdf",
      "LinkText": "Read the paper",
      "Description": [
        "Environmental storytelling is a form of storytelling commonly used in video games that relies on spatial design for the purpose of conveying a narrative. This paper analyses the potential of environmental storytelling in embedding Kenyan oral traditions in an effort to digitally preserve Indigenous oral literature through the use of Interactive Digital Narratives (IDNs). First, a literature review is conducted to find taxonomies and decide on definitions related to the topics of IDNs, Indigenous people, and environmental storytelling. Then, an interview analysis was conducted to explore the need, practicality and ethics behind the digitisation of oral traditions in IDNs. Finally, a prototype was developed to put insights from the prior sections into practice. We find that while environmental storytelling presents an opportunity in IDNs to preserve Kenyan oral traditions in a way that emphasizes multiple perspectives, challenges remain in the preservation of the storyteller’s performance."
      ]
    },
    {
      "Name": "Bias in Machine Learning Algorithms for Automotive Applications and Related Ethical Concerns",
      "Status": "Complete",
      "Date": "2022-10-30T00:00:00Z",
      "Tags": ["Research"],
      "Link": "/documents/Bias_in_Machine_Learning_Algorithms_for_Automotive_Applications_and_Related_Ethical_Concerns.pdf",
      "LinkText": "Read the paper",
      "Description": [
        "Machine learning (ML) is an ever-expanding field of research that has garnered attention over the past decades for breakthrough performances in the completion of complex tasks that were once thought to be only achievable to humans. With an increasing demand for automated decision systems based on ML, the automotive industry is now preparing for the development and widespread adoption of autonomous vehicles. At the same time, however, a growing number of issues related to bias in the performance of ML algorithms is raising concerns about the current state of fairness in algorithms and whether or not ML algorithms can be trusted to make fair decisions under realistic circumstances, particularly when the safety of a human is at risk.",
        "This thesis aims to review literature surrounding the topic of algorithmic bias in computer vision (CV) and provide information about possible causes of algorithmic bias, the practical effects of bias in CV and concrete strategies for overcoming bias in automotive applications specifically. In doing so, we delve into relevant works, discuss notable instances of algorithmic bias in practice within recent memory and cover some of the underlying theories in computer vision and machine learning."
      ]
    },
    {
      "Name": "3DS Max Scene",
      "Status": "Complete",
      "Date": "2024-12-10T00:00:00Z",
      "Image": "CS7029 - Nangole Martin - Assignment 3.jpg",
      "Tags": ["3D Modelling"],
      "Description": [
        "A prototype of a mobile app designed for task management, built using a popular prototyping tool."
      ]
    }
  ]
}
